app/controllers/password_resets_controller.rb

def create
  @user = User.find_by(email: params[:password_reset][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "dominickfabian@gmail.com"], ["LIMIT", 1]]

  def update
    if params[:user][:password].empty?            # saves from blank new password and confirmation
      @user.errors.add(:password, "Can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)     # successful password reset
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$qi7CbSxH857s.r.z5P7S5ePqOSUelXfsmmVfJVJs1ywfrplwsZ2He"], ["updated_at", 2017-02-04 01:35:30 UTC], ["id", 3]]