app/controllers/users_controller.rb

  def index
    @users = User.where(activated: true).paginate(page: params[:page]) # show only the first page of (not all)
---
SELECT  "users".* FROM "users" WHERE "users"."activated" = ? LIMIT ? OFFSET ?  [["activated", true], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = ?  [["activated", true]]

  def create
    @user = User.new(user_params)  # see below private method
    if @user.save  # is a successful new user
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Dom Fabian"], ["password_digest", "$2a$10$txvOJcFRM3zj2zV7No5ZXuxvDaqsQT6xMYwahaA9l61XLb6vR/596"], ["updated_at", 2017-01-19 23:54:00 UTC], ["id", 1]]

  def destroy
    User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]